---
type: Transaction
namespace: Autodesk.Revit.DB
version: 2024
members: 16
tags: [revit-api, class]
---

# Transaction

`Autodesk.Revit.DB.Transaction` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Transaction | — | `` |
| Method | Commit | — | `` |
| Method | Commit | — | `public TransactionStatus Commit ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFailureHandlingOptions | — | `public FailureHandlingOptions GetFailureHandlingOptions ()` |
| Method | GetName | — | `public string GetName ()` |
| Method | GetStatus | — | `public TransactionStatus GetStatus ()` |
| Method | HasEnded | — | `public bool HasEnded ()` |
| Method | HasStarted | — | `public bool HasStarted ()` |
| Method | RollBack | — | `` |
| Method | RollBack | — | `public TransactionStatus RollBack ()` |
| Method | SetFailureHandlingOptions | — | `public void SetFailureHandlingOptions ( FailureHandlingOptions options )` |
| Method | SetName | — | `public void SetName ( string name )` |
| Method | Start | — | `` |
| Method | Start | — | `public TransactionStatus Start ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |